src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ОформлениеСобственногоБрака/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ПроизводственноеЗадание = Параметры.ПЗ;
Изделие = Параметры.Изделие;
Количество = Параметры.Количество;
	Если Не ПроизводственноеЗадание.Пустая() Тогда
	МестоХранения = ПроизводственноеЗадание.Линейка.МестоХраненияГП;
	КоличествоНаСкладе = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(МестоХранения,Изделие);
	Иначе
	КоличествоБрака = Количество;
	КонецЕсли;                                                                                         
КонецПроцедуры

&НаСервере
Процедура МестоХраненияПриИзмененииНаСервере()
КоличествоНаСкладе = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(МестоХранения,Изделие); 
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
МестоХраненияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ОформитьСписаниеБракаНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
	Списание.Дата = ТекущаяДата();
	Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(МестоХранения.Подразделение));
	Списание.Автор = ПараметрыСеанса.Пользователь;
		Если Не ПроизводственноеЗадание.Пустая() Тогда
		Списание.ДокументОснование = ПроизводственноеЗадание;
		КонецЕсли; 
	Списание.Подразделение = МестоХранения.Подразделение;
	Списание.МестоХранения = МестоХранения;
	Списание.Статья = Статья;
	Списание.РабочееМесто = РабочееМесто;
	Списание.ВидБрака = ВидБрака;
	Списание.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Списание.Утвердил = ПараметрыСеанса.Пользователь;
	Списание.Комментарий = Комментарий;  
	ТЧ = Списание.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	ТЧ.МПЗ = Изделие;
	ТЧ.Количество = КоличествоБрака/Изделие.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения = Изделие.ОсновнаяЕдиницаИзмерения;
	Списание.Записать(РежимЗаписиДокумента.Проведение);
		Если Не ПроизводственноеЗадание.Пустая() Тогда
			Если Изделие.Канбан.Служебный Тогда	
				Если Не СоздатьПодчиненныеМТК() Тогда
				Сообщить("Подчиненные МТК не созданы!");	
				ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
				Возврат(Неопределено);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Списание.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьЛинейкуКанбана(Линейка,ВидКанбана)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинейкиЛинейкиПотребители.Ссылка
	|ИЗ
	|	Справочник.Линейки.ЛинейкиПотребители КАК ЛинейкиЛинейкиПотребители
	|ГДЕ
	|	ЛинейкиЛинейкиПотребители.Линейка = &Линейка
	|	И ЛинейкиЛинейкиПотребители.Ссылка.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		Если ВыборкаДетальныхЗаписей.Ссылка.ВидыКанбанов.Найти(ВидКанбана,"ВидКанбана") <> Неопределено Тогда
		Возврат(ВыборкаДетальныхЗаписей.Ссылка);
		КонецЕсли;
	КонецЦикла; 
Возврат(Неопределено);
КонецФункции

&НаСервере
Функция РаскрытьНаМПЗ(МТК,Спецификация,Количество,Результат)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Спецификация,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаНР.Элемент.Канбан) Тогда
			Если ВыборкаНР.Элемент.Канбан.Служебный Тогда 
			ЛинейкаКанбана = ПолучитьЛинейкуКанбана(МТК.Линейка,ВыборкаНР.Элемент.Канбан);
				Если ЛинейкаКанбана <> Неопределено Тогда
				ВыбМТК = ОбщийМодульСозданиеДокументов.СоздатьМТККанбан(ЛинейкаКанбана,МТК.Линейка.МестоХраненияКанбанов,1,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Ложь,МТК,"",0);
				Иначе
				Результат = Ложь;
				Сообщить(МТК.Номер+" > "+СокрЛП(ВыборкаНР.Элемент.Наименование)+" - не найдена линейка-поставщик канбана для "+МТК.Линейка);
				Возврат(Результат);
				КонецЕсли;
			Результат = РаскрытьНаМПЗ(ВыбМТК,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Результат);
			КонецЕсли;
		Иначе
		Результат = РаскрытьНаМПЗ(МТК,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Результат);		
		КонецЕсли; 
	КонецЦикла;
Возврат(Результат);
КонецФункции

&НаСервере
Функция СоздатьПодчиненныеМТК()
ВыбМТК = ОбщийМодульСозданиеДокументов.СоздатьМТККанбан(ПроизводственноеЗадание.Линейка,ПроизводственноеЗадание.Линейка.МестоХраненияКанбанов,1,Изделие,КоличествоБрака,Ложь,ПроизводственноеЗадание.ДокументОснование.ДокументОснование,"",0);
Возврат(РаскрытьНаМПЗ(ВыбМТК,Изделие,КоличествоБрака,Истина));
КонецФункции

&НаСервере
Функция ОформитьПеремещениеБракаНаСервере()
ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Линейка",ПроизводственноеЗадание.Линейка));
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
	Перемещение.Дата = ТекущаяДата();
	Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(МестоХранения.Подразделение));
	Перемещение.Автор = ПараметрыСеанса.Пользователь;
		Если Не ПроизводственноеЗадание.Пустая() Тогда
		Перемещение.ДокументОснование = ПроизводственноеЗадание;
		КонецЕсли;
	Перемещение.Подразделение = МестоХранения.Подразделение;
	Перемещение.Сотрудник = ПаспортЛинейки.Мастер;
	Перемещение.МестоХранения = МестоХранения;
	Перемещение.МестоХраненияВ = Изделие.Канбан.Подразделение.МестоХраненияБрака;
	Перемещение.РабочееМесто = РабочееМесто;
	Перемещение.ВидБрака = ВидБрака;
	Перемещение.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Перемещение.Комментарий = СокрЛП(ВидБрака.Наименование)+". "+СокрЛП(Статья.Наименование)+" ("+СокрЛП(Комментарий)+")";
	ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	ТЧ.МПЗ = Изделие;
	ТЧ.Количество = КоличествоБрака/Изделие.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения =  Изделие.ОсновнаяЕдиницаИзмерения;	
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		Если Не ПроизводственноеЗадание.Пустая() Тогда
			Если Изделие.Канбан.Служебный Тогда	
				Если Не СоздатьПодчиненныеМТК() Тогда
				Сообщить("Подчиненные МТК не созданы!");	
				ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
				Возврат(Неопределено);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Перемещение.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура Списать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если КоличествоБрака <= КоличествоНаСкладе Тогда
			Если КоличествоБрака <= Количество Тогда
			Результат = ОформитьСписаниеБракаНаСервере();
				Если Результат <> Неопределено Тогда
				ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
				Этаформа.Закрыть(Истина);
				КонецЕсли;		
			Иначе	
			Сообщить("Выбранное кол-во брака превышает исходное кол-во!");
			КонецЕсли;
		Иначе
		Сообщить("Выбранное кол-во брака превышает кол-во на складе!");				
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Переместить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если КоличествоБрака <= КоличествоНаСкладе Тогда
			Если КоличествоБрака <= Количество Тогда
			Результат = ОформитьПеремещениеБракаНаСервере();
				Если Результат <> Неопределено Тогда
				ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
				Этаформа.Закрыть(Истина);
				КонецЕсли;		
			Иначе	
			Сообщить("Выбранное кол-во брака превышает исходное кол-во!");
			КонецЕсли;
		Иначе
		Сообщить("Выбранное кол-во брака превышает кол-во на складе!");				
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппуВидовБрака()
ТекРодитель = Изделие.Родитель;
	Пока Не ТекРодитель.Пустая() Цикл		
		Если Не ТекРодитель.ВидБрака.Пустая() Тогда
		Возврат(ТекРодитель.ВидБрака);
		КонецЕсли; 
	ТекРодитель = ТекРодитель.Родитель;	
	КонецЦикла; 
Возврат(Справочники.ВидыБрака.ПустаяСсылка());
КонецФункции

&НаСервере
Процедура ПолучитьЭтапЖизненногоЦикла()
	Если ВидБрака.ЭтапЖизненногоЦикла.Пустая() Тогда
	ЭтапЖизненногоЦикла = ОбщийМодульВызовСервера.ПолучитьЭтапЖизненногоЦикла(Изделие);	
	Иначе	
	ЭтапЖизненногоЦикла = ВидБрака.ЭтапЖизненногоЦикла;
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ВидБракаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("Справочник.ВидыБрака.Форма.ФормаВыбораПоГруппе",Новый Структура("Родитель",ПолучитьГруппуВидовБрака()));
Результат = Ф.ОткрытьМодально(); 
	Если Результат <> Неопределено Тогда
	ВидБрака = Результат;
	ПолучитьЭтапЖизненногоЦикла();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
Этаформа.Закрыть(Ложь);
КонецПроцедуры
